function J = jacobian_6dof(q)
% =========================================================
% 6-DOF 机械臂几何雅可比矩阵
% =========================================================

    T_all = fkine_all(q);

    % 末端位置
    p_e = T_all(1:3,4,6);

    % 初始化
    J = zeros(6,6);

    % 基坐标系
    z0 = [0;0;1];
    p0 = [0;0;0];

    for i = 1:6
        if i == 1
            z = z0;
            p = p0;
        else
            z = T_all(1:3,3,i-1);
            p = T_all(1:3,4,i-1);
        end

        % 线速度部分
        J(1:3,i) = cross(z, p_e - p);

        % 角速度部分
        J(4:6,i) = z;
    end
end
